# -*- coding: utf-8 -*-
#############################################################################
##
## Copyright (C) 2017-2023 SAMSON Group. All rights reserved.
##
#############################################################################
##
## Это программа является свободным программным обеспечением.
## Вы можете использовать, распространять и/или модифицировать её согласно
## условиям GNU GPL версии 3 или любой более поздней версии.
##
#############################################################################
##
## Поддержка ККМ Штрих через через fr_drv_ng
## ( https://github.com/shtrih-m/fr_drv_ng )
## + своя обвязка, работающая через ctypes
##
#############################################################################