# -*- coding: utf-8 -*-
#############################################################################
##
## Copyright (C) 2006-2012 Chuk&Gek and Vista Software. All rights reserved.
## Copyright (C) 2012-2020 SAMSON Group. All rights reserved.
##
#############################################################################
##
## Это программа является свободным программным обеспечением.
## Вы можете использовать, распространять и/или модифицировать её согласно
## условиям GNU GPL версии 3 или любой более поздней версии.
##
#############################################################################

from PyQt4 import QtGui
from PyQt4.QtCore import Qt, QDate, QDateTime, QString, QTime

from library.MapCode          import createMapCodeToRowIdx
from library.Utils            import calcAgeTuple, forceBool, forceDate, forceInt, forceRef, forceString, getRetirementAge

from Orgs.Utils               import getOrgStructureFullName
from Events.ActionServiceType import CActionServiceType
from Events.Utils             import getActionTypeIdListByFlatCode, getDeathDate

from Reports.Report           import CReport, normalizeMKB
from Reports.ReportBase       import CReportBase, createTable
from Reports.ReportView       import CPageFormat
from Reports.StationaryF007   import getStringProperty

from Reports.Utils            import ( dateRangeAsStr,
                                       getDataOrgStructure,
                                       getDataOrgStructure_HBDS,
                                       getOrgStructureProperty,
                                       getStringPropertyForTableName,
                                       getStringPropertyValue,
                                     )

from Reports.Ui_StationaryF14Setup import Ui_StationaryF14SetupDialog


class AgeGroup:
    Adult = 1
    Senior = 2
    Children = 3

Rows2000 = [
    (u'Всего', u'1.0', u'A00-T98'),
    (u'в том числе:\nНекоторые инфекционные и паразитарные болезни', u'2.0', u'A00-B99'),
    (u'из них:\nкишечные инфекции', u'2.1', u'A00-A09'),
    (u'туберкулез органов дыхания', u'2.2', u'A15-A16'),
    (u'менингококковая инфекция', u'2.3', u'A39'),
    (u'сепсис', u'2.4', u'A40-A41'),
    (u'инфекции, передающиеся приемущественно половым путем', u'2.5', u'A50-A64'),
    (u'острый полиомиелит', u'2.6', u'A80'),
    (u'вирусный гепатит', u'2.7', u'B15-B19'),
    (u'болезнь, вызванная ВИЧ', u'2.8', u'B20-B24'),
    (u'новообразования', u'3.0', u'C00-D48'),
    (u'в том числе:\nзлокачественные новообразования', u'3.1', u'C00-C97'),
    (u'из них:\nзлокачественные новообразования молочной железы', u'3.1.1', u'C50'),
    (u'злокачественные новообразования глаза, головного мозга и других отделов центральной нервной системы', u'3.1.2', u'C69-C72'),
    (u'злокачественные новообразования сетчатки', u'3.1.2.1', u'C69.2'),
    (u'злокачественные новообразования лимфоидной, кроветворной и родственных им тканей', u'3.1.3', u'C81-C96'),
    (u'из них:\nфолликулярная лимфома', u'3.1.3.1', u'C82'),
    (u'мелкоклеточная (диффузная) нефолликулярная лимфома', u'3.1.3.2', u'C83.0'),
    (u'мелкоклеточная с расщепленными ядрами (диффузная) нефолликулярная лимфома', u'3.1.3.3', u'C83.1'),
    (u'крупноклеточная (диффузная) нефолликулярная лимфома', u'3.1.3.4', u'C83.3'),
    (u'другие типы диффузных нефолликулярных лимфом', u'3.1.3.5', u'C83.8'),
    (u'диффузная нефолликулярная лимфома неуточненная', u'3.1.3.6', u'C83.9'),
    (u'зрелые T/NK-клеточные лимфомы', u'3.1.3.7', u'C84'),
    (u'из них:\nдругие зрелые T/NK-клеточные лимфомы', u'3.1.3.7.1', u'C84.5'),
    (u'другие и неуточненные типы неходжкинской лимфомы', u'3.1.3.8', u'C85'),
    (u'макроглобулинемия Вальденстрема', u'3.1.3.9', u'C88.0'),
    (u'хронический лимфоцитарный лейкоз', u'3.1.3.10', u'C91.1'),
    (u'хронический миелоидный лейкоз', u'3.1.3.11', u'C92.1'),
    (u'доброкачественные новообразования', u'3.2', u'D10-D36'),
    (u'из них:\nлейомиома матки', u'3.2.1', u'D25'),
    (u'доброкачественные новообразования яичника', u'3.2.2', u'D27'),
    (u'болезни крови, кроветворных органов и отдельные нарушения, вовлекающие иммунный механизм', u'4.0', u'D50-D89'),
    (u'из них:\nанемии', u'4.1', u'D50-D64'),
    (u'из них:\nапластические анемии', u'4.1.1', u'D60-D61'),
    (u'нарушения свертываемости крови, пурпура и другие геморрагические состояния', u'4.2', u'D65-D69'),
    (u'из них:\nгемофилия', u'4.2.1', u'D66-D68'),
    (u'отдельные нарушения, вовлекающие иммунный механизм', u'4.3', u'D80-D89'),
    (u'болезни эндокринной системы, расстройства питания и нарушения обмена веществ', u'5.0', u'E00-E89'),
    (u'из них:\nболезни щитовидной железы, связанные с йодной недостаточностью, и сходные состояния', u'5.1', u'E01-E03'),
    (u'тиреотоксикоз (гипертиреоз)', u'5.2', u'E05'),
    (u'тиреоидит', u'5.3', u'E06'),
    (u'сахарный диабет', u'5.4', u'E10-E14'),
    (u'из него:\nсахарный диабет I типа', u'5.4.1', u'E10'),
    (u'сахарный диабет II типа', u'5.4.2', u'E11'),
    (u'с поражением почек', u'5.4.3', u'E10.2, E11.2, E12.2, E13.2, E14.2'),
    (u'с поражением глаз', u'5.4.4', u'E10.3, E11.3, E12.3, E13.3, E14.3'),
    (u'гиперфункция гипофиза', u'5.5', u'E22'),
    (u'гипопитуитаризм', u'5.6', u'E23.0'),
    (u'несахарный диабет', u'5.7', u'E23.2'),
    (u'адреногенитальные расстройства', u'5.8', u'E25'),
    (u'дисфункция яичников', u'5.9', u'E28'),
    (u'дисфункция яичек', u'5.10', u'E29'),
    (u'ожирение', u'5.11', u'E66'),
    (u'фенилкетонурия', u'5.12', u'E70.0-1'),
    (u'нарушения обмена галактозы (галактоземия)', u'5.13', u'E74.2'),
    (u'болезнь Гоше', u'5.14', u'E75.2'),
    (u'нарушения обмена гликозаминогликанов (мукополисахаридозы)', u'5.15', u'E76.0-3'),
    (u'муковисцидоз', u'5.16', u'E84'),
    (u'психические расстройства и расстройства поведения', u'6.0', u'F01-F99'),
    (u'из них:\nпсихические расстройства и расстройства поведения, связанные с употреблением психоактивных веществ', u'6.1', u'F10-F19'),
    (u'болезни нервной системы', u'7.0', u'G00-G98'),
    (u'из них:\nвоспалительные болезни центральной нервной системы', u'7.1', u'G00-G09'),
    (u'из них:\nбактериальный менингит', u'7.1.1', u'G00'),
    (u'энцефалит, миелит и энцефаломиелит', u'7.1.2', u'G04'),
    (u'системные атрофии, поражающие преимущественно центральную нервную систему', u'7.2', u'G10-G12'),
    (u'экстрапирамидные и другие двигательные нарушения', u'7.3', u'G20, G21, G23-G25'),
    (u'из них:\nболезнь Паркинсона', u'7.3.1', u'G20'),
    (u'другие экстрапирамидные и двигательные нарушения', u'7.3.2', u'G25'),
    (u'другие дегенеративные болезни нервной системы', u'7.4', u'G30-G31'),
    (u'из них:\nболезнь Альцгеймера', u'7.4.1', u'G30'),
    (u'демиелинизирующие болезни центральной нервной системы', u'7.5', u'G35-G37'),
    (u'из них:\nрассеянный склероз', u'7.5.1', u'G35'),
    (u'эпизодические и пароксизмальные расстройства', u'7.6', u'G40-G47'),
    (u'из них:\nэпилепсия, эпилептический статус', u'7.6.1', u'G40-G41'),
    (u'преходящие транзиторные церебральные ишемические приступы (атаки) и родственные синдромы', u'7.6.2', u'G45'),
    (u'поражения отдельных нервов, нервных корешков и сплетений, полиневропатии и другие поражения периферической нервной системы', u'7.7', u'G50-G64'),
    (u'из них:\nсиндром Гийена-Барре', u'7.7.1', u'G61.0'),
    (u'болезни нервно-мышечного синапса и мышц', u'7.8', u'G70-G73'),
    (u'из них:\nмиастения', u'7.8.1', u'G70.0, 2'),
    (u'мышечная дистрофия Дюшенна', u'7.8.2', u'G71.0'),
    (u'церебральный паралич и другие паралитические синдромы', u'7.9', u'G80-G83'),
    (u'из них:\nцеребральный паралич', u'7.9.1', u'G80'),
    (u'расстройства вегетативной (автономной) нервной системы', u'7.10', u'G90'),
    (u'сосудистые миелопатии', u'7.11', u'G95.1'),
    (u'болезни глаза и его придаточного аппарата', u'8.0', u'H00-H59'),
    (u'из них:\nязва роговицы', u'8.1', u'H16.0'),
    (u'из них:\nкатаракта', u'8.2', u'H25-H26'),
    (u'хориоретинальное воспаление', u'8.3', u'H30'),
    (u'отслойка сетчатки с разрывом сетчатки', u'8.4', u'H33.0'),
    (u'дегенерация макулы и заднего полюса', u'8.5', u'H35.3'),
    (u'глаукома', u'8.6', u'H40'),
    (u'дегенеративная миопия', u'8.7', u'H44.2'),
    (u'болезни зрительного нерва и зрительных путей', u'8.8', u'H46-H48'),
    (u'атрофия зрительного нерва', u'8.8.1', u'H47.2'),
    (u'слепота и пониженное зрение', u'8.9', u'H54'),
    (u'из них:\nслепота обоих глаз', u'8.9.1', u'H54.0'),
    (u'болезни уха и сосцевидного отростка', u'9.0', u'H60-H95'),
    (u'из них:\nболезни среднего уха и сосцевидного отростка', u'9.1', u'H65-H66, H68-H74'),
    (u'из них:\nострый отит', u'9.1.1', u'H65.0-1, H66.0'),
    (u'хронический отит', u'9.1.2', u'H65.2-4, H66.1-3'),
    (u'болезни слуховой (евстахиевой) трубы', u'9.1.3', u'H68-H69'),
    (u'перфорация барабанной перепонки', u'9.1.4', u'H72'),
    (u'другие болезни среднего уха и сосцевидного отростка', u'9.1.5', u'H74'),
    (u'болезни внутреннего уха', u'9.2', u'H80, H81, H83'),
    (u'из них:\nотосклероз', u'9.2.1', u'H80'),
    (u'болезнь Меньера', u'9.2.2', u'H81.0'),
    (u'кондуктивная и нейросенсорная потеря слуха', u'9.3', u'H90'),
    (u'из них:\nкондуктивная потеря слуха двусторонняя', u'9.3.1', u'H90.0'),
    (u'нейросенсорная потеря слуха двусторонняя', u'9.3.2', u'H90.3'),
    (u'болезни системы кровообращения', u'10.0', u'I00-I99'),
    (u'из них:\nострая ревматичесская лихорадка', u'10.1', u'I00-I02'),
    (u'хронические ревматические болезни сердца', u'10.2', u'I05-I09'),
    (u'из них:\nревматические поражения клапанов', u'10.2.1', u'I05-I08'),
    (u'болезни, характеризующиеся повышенным кровяным давлением', u'10.3', u'I10-I13'),
    (u'из них:\nэссенциальная гипертензия', u'10.3.1', u'I10'),
    (u'гипертензивная болезнь сердца (гипертоническая болезнь с преимущественным поражением сердца)', u'10.3.2', u'I11'),
    (u'гипертензивная болезнь почек (гипертоническая болезнь с преимущественным поражением почек)', u'10.3.3', u'I12'),
    (u'гипертензивная болезнь сердца и почек (гипертоническая болезнь с преимущественным поражением сердца и почек)', u'10.3.4', u'I13'),
    (u'ишемические болезни сердца', u'10.4', u'I20-I25'),
    (u'из них:\nстенокардия', u'10.4.1', u'I20'),
    (u'из нее:\nнестабильная стенокардия', u'10.4.1.1', u'I20.0'),
    (u'острый инфаркт миокарда', u'10.4.2', u'I21'),
    (u'повторный инфаркт миокарда', u'10.4.3', u'I22'),
    (u'другие формы острой ишемической болезни сердца', u'10.4.4', u'I24'),
    (u'хроническая ишемическая болезнь сердца', u'10.4.5', u'I25'),
    (u'из нее:\nпостинфарктный кардиосклероз', u'10.4.5.1', u'I25.8'),
    (u'другие формы легочно-сердечной недостаточности', u'10.5', u'I27'),
    (u'другие болезни сердца', u'10.6', u'I30-I51'),
    (u'из них:\nострый перикардит', u'10.6.1', u'I30'),
    (u'из них:\nострый и подострый эндокардит', u'10.6.2', u'I33'),
    (u'неревматические поражения клапанов', u'10.6.3', u'I34-I37'),
    (u'острый миокардит', u'10.6.4', u'I40'),
    (u'кардиомиопатия', u'10.6.5', u'I42'),
    (u'предсердно-желудочковая (атриовентрикулярная) блокада', u'10.6.6', u'I44.0-I44.3'),
    (u'желудочковая тахикардия', u'10.6.7', u'I47.2'),
    (u'фибрилляция и трепетание предсердий', u'10.6.8', u'I48'),
    (u'синдром слабости синусового узла', u'10.6.9', u'I49.5'),
    (u'цереброваскулярные болезни', u'10.7', u'I60-I69'),
    (u'из них:\nсубарахноидальное кровоизлияние', u'10.7.1', u'I60'),
    (u'внутримозговое и другое внутричерепное кровоизлияние', u'10.7.2', u'I61, I62'),
    (u'инфаркт мозга', u'10.7.3', u'I63'),
    (u'инсульт, не уточненный как кровоизлияние или инфаркт', u'10.7.4', u'I64'),
    (u'закупорка и стеноз прецеребральных, церебральных артерий, не приводящие к инфаркту мозга', u'10.7.5', u'I65-I66'),
    (u'другие цереброваскулярные болезни', u'10.7.6', u'I67'),
    (u'из них:\nцеребральный атеросклероз', u'10.7.6.1', u'I67.2'),
    (u'атеросклероз артерий конечностей, тромбангиит облитерирующий', u'10.8', u'I70.2, I73.1'),
    (u'болезни вен, лимфатических сосудов и лимфатических узлов', u'10.9', u'I80-I89'),
    (u'из них:\nфлебит и тромбофлебит', u'10.9.1', u'I80'),
    (u'тромбоз портальной вены', u'10.9.2', u'I81'),
    (u'варикозное расширение вен нижних конечностей', u'10.9.3', u'I83'),
    (u'болезни органов дыхания', u'11.0', u'J00-J98'),
    (u'из них:\nострые респираторные инфекции верхних дыхательных путей', u'11.1', u'J00-J06'),
    (u'из них:\nострый ларингит и трахеит', u'11.1.1', u'J04'),
    (u'острый обструктивный ларингит (круп) и эпиглоттит', u'11.1.2', u'J05'),
    (u'грипп', u'11.2', u'J09-J11'),
    (u'пневмонии', u'11.3', u'J12-J18'),
    (u'острые респираторные инфекции нижних дыхательных путей ', u'11.4', u'J20-J22'),
    (u'аллергический ринит (поллиноз)', u'11.5', u'J30.1'),
    (u'хронические болезни миндалин и аденоидов, перитонзиллярный абсцесс', u'11.6', u'J35-J36'),
    (u'бронхит хронический и неуточненный, эмфизема', u'11.7', u'J40-J43'),
    (u'другая хроническая обструктивная легочная болезнь', u'11.8', u'J44'),
    (u'бронхоэктатическая болезнь', u'11.9', u'J47'),
    (u'астма; астматический статус', u'11.10', u'J45, J46'),
    (u'другие интерстициальные легочные болезни, гнойные и некротические состояния нижних дыхательных путей, другие болезни плевры', u'11.11', u'J84-J94'),
    (u'болезни органов пищеварения', u'12.0', u'K00-K92'),
    (u'из них:\nязва желудка и двенадцатиперстной кишки', u'12.1', u'K25-K26'),
    (u'гастрит и дуоденит', u'12.2', u'K29'),
    (u'грыжи', u'12.3', u'K40-K46'),
    (u'неинфекционный энтерит и колит', u'12.4', u'K50-K52'),
    (u'из них:\nболезнь Крона', u'12.4.1', u'K50'),
    (u'язвенный колит', u'12.4.2', u'K51'),
    (u'другие болезни кишечника', u'12.5', u'K55-K63'),
    (u'из них:\nпаралитический илеус и непроходимость кишечника без грыжи', u'12.5.1', u'K56'),
    (u'дивертикулярная болезнь кишечника', u'12.5.2', u'K57'),
    (u'синдром раздраженного кишечника', u'12.5.3', u'K58'),
    (u'трещина и свищ области заднего прохода и прямой кишки', u'12.5.4', u'K60'),
    (u'абсцесс области заднего прохода и прямой кишки', u'12.5.5', u'K61'),
    (u'геморрой', u'12.6', u'K64'),
    (u'болезни печени', u'12.8', u'K70-K76'),
    (u'из них:\nфиброз и цирроз печени', u'12.8.1', u'K74'),
    (u'болезни желчного пузыря, желчевыводящих путей', u'12.9', u'K80-K83'),
    (u'болезни поджелудочной железы', u'12.10', u'K85-K86'),
    (u'из них:\nострый панкреатит', u'12.10.1', u'K85'),
    (u'болезни кожи и подкожной клетчатки', u'13.0', u'L00-L98'),
    (u'из них: пузырчатка', u'13.1', u'L10'),
    (u'буллезный пемфигоид', u'13.2', u'L12'),
    (u'дерматит герпетиформный Дюринга', u'13.3', u'L13.0'),
    (u'атопический дерматит', u'13.4', u'L20'),
    (u'псориаз', u'13.5', u'L40'),
    (u'из него:\nпсориаз артропатический', u'13.5.1', u'L40.5'),
    (u'дискоидная красная волчанка', u'13.6', u'L93.0'),
    (u'локализованная склеродермия', u'13.7', u'L94.0'),
    (u'болезни костно-мышечной системы и соединительной ткани', u'14.0', u'M00-M99'),
    (u'из них:\nартропатии', u'14.1', u'M00-M25'),
    (u'из них:\nреактивные артропатии', u'14.1.1', u'M02'),
    (u'серопозитивный и другие ревматоидные артриты', u'14.1.2', u'M05-M06'),
    (u'юношеский (ювенильный) артрит', u'14.1.3', u'M08'),
    (u'артрозы', u'14.1.4', u'M15-M19'),
    (u'системные поражения соединительной ткани', u'14.2', u'M30-M35'),
    (u'из них: системная красная волчанка', u'14.2.1', u'M32'),
    (u'деформирующие дорсопатии', u'14.3', u'M40-M43'),
    (u'спондилопатии', u'14.4', u'M45-M49'),
    (u'из них: анкилозирующий спондилит', u'14.4.1', u'M45'),
    (u'другие дорсопатии', u'14.5', u'M50-M54'),
    (u'поражения синовиальных оболочек и сухожилий', u'14.6', u'M65-M67'),
    (u'остеопатии и хондропатии', u'14.7', u'M80-M94'),
    (u'из них:\nостеопорозы', u'14.7.1', u'M80-M81'),
    (u'болезни мочеполовой системы', u'15.0', u'N00-N99'),
    (u'из них:\nгломерулярные, тубулоинтерстициальные болезни почек, другие болезни почки и мочеточника', u'15.1', u'N00-N15, N25-N28'),
    (u'почечная недостаточность', u'15.2', u'N17-N19'),
    (u'мочекаменная болезнь', u'15.3', u'N20-N21, N23'),
    (u'другие болезни мочевой системы', u'15.4', u'N30-N32, N34-N36, N39'),
    (u'болезни предстательной железы', u'15.5', u'N40-N42'),
    (u'доброкачественная дисплазия молочной железы', u'15.6', u'N60'),
    (u'воспалительные болезни женских тазовых органов', u'15.7', u'N70-N73, N75-N76'),
    (u'из них:\nсальпингит и оофорит', u'15.7.1', u'N70'),
    (u'эндометриоз', u'15.8', u'N80'),
    (u'эрозия и эктропион шейки матки', u'15.9', u'N86'),
    (u'расстройства менструаций', u'15.10', u'N91-N94'),
    (u'женское бесплодие', u'15.11', u'N97'),
    (u'беременность, роды и послеродовой период', u'16.0', u'O00-O99'),
    (u'отдельные состояния, возникающие в перинатальном периоде', u'17.0', {AgeGroup.Adult: u'P00-P04', AgeGroup.Senior: u'P00-P04', AgeGroup.Children: u'P05-P96'}),
    (u'врожденные аномалии (пороки развития), деформации и хромосомные нарушения', u'18.0', u'Q00-Q99'),
    (u'из них:\nврожденные аномалии (пороки развития) нервной системы', u'18.1', u'Q00-Q07'),
    (u'врожденные аномалии глаза', u'18.2', u'Q10-Q15'),
    (u'врожденные аномалии системы кровообращения', u'18.3', u'Q20-Q28'),
    (u'врожденные аномалии органов пищеварения', u'18.4', u'Q38-Q45'),
    (u'из них: болезнь Гиршпрунга', u'18.4.1', u'Q43'),
    (u'врожденные аномалии женских половых органов', u'18.5', u'Q50-Q52'),
    (u'неопределенность пола и псевдогермафродитизм', u'18.6', u'Q56'),
    (u'врожденный ихтиоз', u'18.7', u'Q80'),
    (u'нейрофиброматоз (незлокачественный)', u'18.8', u'Q85.0'),
    (u'синдром Дауна', u'18.9', u'Q90'),
    (u'симптомы, признаки и оклонения от нормы, выявленные при клинических и лабораторных исследованиях, не классифицированные в других рубриках', u'19.0', u'R00-R99'),
    (u'травмы, отравления и некоторые другие последствия воздействия внешних причин', u'20.0', u'S00-T98'),
    (u'из них:\nпереломы', u'20.1', u'S02, S12, S22, S32, S42, S52, S62, S72, S82, S92, T02, T08, T10, T12, T14.2'),
    (u'из них:\nпереломы черепа и лицевых костей', u'20.1.1', u'S02'),
    (u'травма глаза и глазницы', u'20.2', u'S05'),
    (u'внутричерепная травма', u'20.3', u'S06'),
    (u'термические и химические ожоги', u'20.4', u'T20-T30'),
    (u'отравления лекарственными средствами, медикаментами и биологическими веществами', u'20.5', u'T36-T50'),
    (u'из них: отравление наркотиками', u'20.5.1', u'T40.0-T40.6'),
    (u'токсическое действие веществ преимущественно немедицинского назначения', u'20.6', u'T51-T65'),
    (u'из них: токсическое действие алкоголя', u'20.6.1', u'T51'),
    (u'COVID-19', u'21.0', u'U07.1-U07.2'),
    (u'Кроме того:\nфакторы, влияющие на состояние здоровья населения и обращения в учреждения здравоохранения', u'22.0', u'Z00-Z99'),
]

Columns2000AdultsDischarge = set([4, 5, 6, 7])
Columns2000AdultsDeath = set([8, 9, 10, 11, 12])
Columns2000SeniorsDischarge = set([13, 14, 15, 16])
Columns2000SeniorsDeath = set([17, 18, 19, 20, 21])
Columns2000ChildrenDischarge = set([22, 23, 24, 25, 26, 27])
Columns2000ChildrenDeath = set([28, 29, 30, 31, 32, 33])
Columns2000Death = Columns2000AdultsDeath | Columns2000SeniorsDeath | Columns2000ChildrenDeath
Columns2000Seniors = Columns2000SeniorsDischarge | Columns2000SeniorsDeath

ExcludeCells2000 = {
    '7.6.2': Columns2000Death,
    '8.1': Columns2000Death,
    '8.2': Columns2000Death,
    '8.3': Columns2000Death,
    '8.4': Columns2000Death,
    '8.5': Columns2000Death,
    '8.6': Columns2000Death,
    '8.8.1': Columns2000Death,
    '8.9': Columns2000Death,
    '8.9.1': Columns2000Death,
    '9.2.1': Columns2000Death,
    '9.3': Columns2000Death,
    '9.3.1': Columns2000Death,
    '9.3.2': Columns2000Death,
    '10.7.5': Columns2000Death,
    '11.5': Columns2000Death,
    '13.7': Columns2000Death,
    '15.6': Columns2000Death,
    '15.9': Columns2000Death,
    '15.10': Columns2000Death,
    '15.11': Columns2000Death,
    '18.2': Columns2000Death,
    '18.6': Columns2000Death,
    '17.0': Columns2000Seniors,
    '22.0': Columns2000Death,
}


Rows4000 = [
    (u'Всего операций', u'', u'1'),
    (u'в том числе операции на нервной системе из них:', u'2', u'2'),
    (u'удаление травматической внутричерепной гематомы, очага ушиба, вдавленного перелома черепа, устранение дефекта черепа и лицевого скелета', u'163', u'2.1'),
    (u'операции при сосудистых пороках мозга', u'164', u'2.2'),
    (u'из них: на аневризмах', u'165', u'2.2.1'),
    (u'из них эндоваскулярное выключение', u'166', u'2.2.1.1'),
    (u'на мальформациях', u'167', u'2.2.2'),
    (u'из них эндоваскулярное выключение', u'168', u'2.2.2.1'),
    (u'операции при церебральном инсульте', u'169', u'2.3'),
    (u'из них: при геморрагическом инсульте', u'170', u'2.3.1'),
    (u'из них открытое удаление гематомы', u'171', u'2.3.1.1'),
    (u'при инфаркте мозга', u'172', u'2.3.2'),
    (u'из них: краниотомия', u'173', u'2.3.2.1'),
    (u'эндоваскулярная тромбоэкстрация', u'174', u'2.3.2.2'),
    (u'операции при окклюзионно-стенотических поражениях сосудов мозга', u'175', u'2.4'),
    (u'из них: на экстрацеребральных отделах сонных и позвоночных артерий', u'176', u'2.4.1'),
    (u'из них: эндартерэктомия, редрессация, реимплантация', u'177', u'2.4.1.1'),
    (u'стентирование', u'178', u'2.4.1.2'),
    (u'на внутричерепных артериях', u'179', u'2.4.2'),
    (u'из них: экстраинтракраниальные анастомозы', u'180', u'2.4.2.1'),
    (u'стентирование', u'181', u'2.4.2.2'),
    (u'удаление опухолей головного, спинного мозга', u'182', u'2.5'),
    (u'операции при функциональных расстройствах', u'183', u'2.6'),
    (u'из них: при болевых синдромах', u'184', u'2.6.1'),
    (u'из них васкулярная декомпрессия', u'185', u'2.6.1.1'),
    (u'при эпилепсии, паркинсонизме, мышечно-тонических расстройствах', u'186', u'2.6.2'),
    (u'из них: резекционные и деструктивные операции', u'187', u'2.6.2.1'),
    (u'установка стимуляторов', u'188', u'2.6.2.2'),
    (u'декомпрессивные, стабилизирующие операции при позвоночно-спинальной травме', u'189', u'2.7'),
    (u'декомпрессивные, стабилизирующие операции при дегенеративных заболеваниях позвоночника', u'190', u'2.8'),
    (u'операции на периферических нервах', u'191', u'2.9'),
    (u'ликворошунтирующие операции', u'192', u'2.10'),
    (u'операции при врожденных аномалиях развития центральной нервной системы', u'193', u'2.11'),
    (u'операции на эндокринной системе', u'3', u'3'),
    (u'из них тиреотомии', u'31', u'3.1'),
    (u'операции на органе зрения', u'4', u'4'),
    (u'из них: кератопластика', u'32', u'4.1'),
    (u'задняя витреоэктомия', u'33', u'4.2'),
    (u'транпупиллярная термотерапия', u'194', u'4.3'),
    (u'брахитерапия', u'195', u'4.4'),
    (u'операции по поводу: глаукомы', u'41', u'4.5'),
    (u'из них с применением шунтов и дренажей', u'161', u'4.5.1'),
    (u'энуклеации', u'42', u'4.6'),
    (u'катаракты', u'43', u'4.7'),
    (u'из них методом факоэмульсификации', u'162', u'4.7.1'),
    (u'интравитреальное введение ингибитора ангиогенеза', u'44', u'4.8'),
    (u'операции на органах уха, горла, носа', u'5', u'5'),
    (u'из них: на ухе', u'51', u'5.1'),
    (u'на миндалинах и аденоидах', u'61', u'5.2'),
    (u'операции на органах дыхания', u'6', u'6'),
    (u'из них: на трахее', u'196', u'6.1'),
    (u'пневмонэктомия', u'62', u'6.2'),
    (u'эксплоративная торакотомия', u'197', u'6.3'),
    (u'операции на сердце', u'7', u'7'),
    (u'из них: на открытом сердце', u'70', u'7.1'),
    (u'из них с искусственным кровообращением', u'701', u'7.1.2'),
    (u'коррекция врожденных пороков сердца', u'71', u'7.2'),
    (u'из них: с искусственным кровообращением', u'721', u'7.2.1'),
    (u'коррекция приобретенных поражений клапанов сердца', u'72', u'7.3'),
    (u'из них: с искусственным кровообращением', u'730', u'7.3.1'),
    (u'эндоваскулярно', u'733', u'7.3.2'),
    (u'при нарушениях ритма - всего', u'73', u'7.4'),
    (u'из них: имплантация кардиостимулятора', u'731', u'7.4.1'),
    (u'из них: трехкамерных', u'7411', u'7.4.1.1'),
    (u'коррекция тахиаритмий', u'732', u'7.4.2'),
    (u'из них катетерных аблаций', u'198', u'7.4.2.1'),
    (u'имплантированных кардиовертеров-дефибриляторов (ИКД)', u'743', u'7.4.3'),
    (u'из них: трехкамерных ИКД', u'7431', u'7.4.3.1'),
    (u'по поводу ишемических болезней сердца', u'74', u'7.5'),
    (u'из них: аортокоронарное шунтирование', u'741', u'7.5.1'),
    (u'из них: с искусственным кровообращением', u'7511', u'7.5.1.1'),
    (u'малоинвазивная реваскуляризация миокарда (МИРМ)', u'7512', u'7.5.1.2'),
    (u'ангиопластика коронарных артерий', u'742', u'7.5.2'),
    (u'из них со стентированием', u'7421', u'7.5.2.1'),
    (u'операции на сосудах', u'8', u'8'),
    (u'из них: операции на артериях', u'81', u'8.1'),
    (u'из них: на питающих головной мозг', u'811', u'8.1.1'),
    (u'из них: каротидные эндартерэктомии', u'8111', u'8.1.1.1'),
    (u'экстраинтракраниальные анастомозы', u'8112', u'8.1.1.2'),
    (u'рентгенэндоваскулярные дилятации', u'8113', u'8.1.1.3'),
    (u'из них со стентированием', u'81131', u'8.1.1.3.1'),
    (u'на почечных артериях', u'812', u'8.1.2'),
    (u'на аорте', u'813', u'8.1.3'),
    (u'из них: при аневризмах и расслоениях восходящего отдела аорты', u'8131', u'8.1.3.1'),
    (u'операции на венах', u'82', u'8.2'),
    (u'операции на органах брюшной полости', u'9', u'9'),
    (u'из них: на желудке по поводу язвенной болезни', u'91', u'9.1'),
    (u'аппендэктомии при хроническом аппендиците', u'92', u'9.2'),
    (u'грыжесечение при неущемленной грыже', u'93', u'9.3'),
    (u'холецистэктомия при хроническом холецистите', u'94', u'9.4'),
    (u'лапаротомия диагностическая', u'95', u'9.5'),
    (u'на кишечнике', u'199', u'9.6'),
    (u'из них на прямой кишке', u'200', u'9.6.1'),
    (u'по поводу геморроя', u'201', u'9.7'),
    (u'операции на почках и мочеточниках', u'10', u'10'),
    (u'операции на мужских половых органах', u'11', u'11'),
    (u'из них операции на предстательной железе', u'111', u'11.1'),
    (u'операции по поводу стерилизации мужчин', u'12', u'12'),
    (u'операции на женских половых органах', u'13', u'13'),
    (u'из них: экстирпация и надвлагалищная ампутация матки', u'131', u'13.1'),
    (u'на придатках матки по поводу бесплодия', u'132', u'13.2'),
    (u'на яичниках по поводу новообразований', u'133', u'13.3'),
    (u'по поводу стерилизации женщин', u'134', u'13.4'),
    (u'выскабливание матки (кроме аборта)', u'135', u'13.5'),
    (u'акушерские операции', u'14', u'14'),
    (u'из них: по поводу внематочной беременности', u'141', u'14.1'),
    (u'наложение щипцов', u'142', u'14.2'),
    (u'вакуум-экстракция', u'143', u'14.3'),
    (u'кесарево сечение в сроке 22 недель беременности и более', u'144', u'14.4'),
    (u'кесарево сечение в сроке менее 22 недель беременности', u'145', u'14.5'),
    (u'аборт', u'146', u'14.6'),
    (u'плодоразрушающие', u'147', u'14.7'),
    (u'экстирпация и надвлагалищная ампутация матки в сроке 22 недель беременности и более, в родах и после родов', u'148', u'14.8'),
    (u'экстирпация и надвлагалищная ампутация матки при прерывании беременности в сроке менее 22 недель беременности или после прерывания', u'149', u'14.9'),
    (u'операции на костно-мышечной системе', u'15', u'15'),
    (u'из них: корригирующие остеотомии', u'152', u'15.1'),
    (u'на челюстно-лицевой области', u'153', u'15.2'),
    (u'при травмах костей таза', u'154', u'15.3'),
    (u'при около- и внутрисуставных переломах', u'155', u'15.4'),
    (u'на позвоночнике', u'156', u'15.5'),
    (u'при врожденном вывихе бедра', u'157', u'15.6'),
    (u'ампутации и экзартикуляции', u'158', u'15.7'),
    (u'из них: по поводу сахарного диабета', u'', u'15.7.1'),
    (u'из них: высокие', u'', u'15.7.1.1'),
    (u'эндопротезирование, всего', u'159', u'15.8'),
    (u'из него: тазобедренного сустава', u'814', u'15.8.1'),
    (u'коленного сустава', u'815', u'15.8.2'),
    (u'на грудной стенке', u'202', u'15.9'),
    (u'из них: торакомиопластика', u'203', u'15.9.1'),
    (u'торакостомия', u'204', u'15.9.2'),
    (u'операции на молочной железе', u'16', u'16'),
    (u'операции на коже и подкожной клетчатке', u'17', u'17'),
    (u'из них операции на челюстно-лицевой области', u'160', u'17.1'),
    (u'операции на средостении', u'205', u'18'),
    (u'из них операции на вилочковой железе', u'206', u'18.1'),
    (u'операции на пищеводе', u'207', u'19'),
    (u'операции на лимфатической системе', u'22', u'20'),
    (u'прочие операции', u'18', u'21'),
]

Rows4100 = [
    (u'Оперировано пациентов - всего, чел.', u'1'),
    (u'из них:\nдети до 17 лет включительно', u'2'),
    (u'лица старше трудоспособного возраста', u'3'),
    (u'Из общего числа операций (стр.1, гр. 3 табл. 4000) проведено операций с использованием, ед.:\nлазерной аппаратуры', u'4'),
    (u'криогенной аппаратуры', u'5'),
    (u'эндоскопической аппаратуры', u'6'),
    (u'из них стерилизации женщин', u'7'),
    (u'рентгеновской аппаратуры', u'8'),
]


def getMkbCodes(row, ageGroup):
    mkbCodes = row[2]
    if isinstance(mkbCodes, dict):
        return mkbCodes[ageGroup]
    else:
        return mkbCodes


def getBegDateTime(params):
    begDate = params.get('begDate', QDate())
    begTime = params.get('begTime', None)
    endDate = params.get('endDate', QDate())
    if not endDate:
        endDate = QDate.currentDate()
    if not begTime:
        begTime = params.get('endTime', QTime(9, 0, 0, 0))
    if not begDate:
        return QDateTime(endDate.addDays(-1), begTime)
    else:
        return QDateTime(begDate, begTime)


def getEndDateTime(params):
    endDate = params.get('endDate', QDate())
    if not endDate:
        endDate = QDate.currentDate()
    endTime = params.get('endTime', QTime(9, 0, 0, 0))
    return QDateTime(endDate, endTime)


def createMapCodeToRowIdx4000(rows):
    mapRowsByNumber = {}
    mapRowsByType = {}
    for i, row in enumerate(rows):
        rowNumber = row[2]
        if rowNumber:
            mapRowsByNumber[rowNumber] = i
    for i, row in enumerate(rows):
        operationType = row[1]
        if operationType:
            rowNumber = row[2]
            rowIndexList = [i]
            while '.' in rowNumber:
                rowNumber = rowNumber.rsplit('.', 1)[0]
                rowIndex = mapRowsByNumber.get(rowNumber)
                rowIndexList.append(rowIndex)
            mapRowsByType[operationType] = rowIndexList
    return mapRowsByType


def selectDataLeavedMkb(params, ageGroup, orgStructureIdList):
    eventOrder = params.get('eventOrder', 0)
    financeId = params.get('financeId', None)
    begDateTime = getBegDateTime(params)
    endDateTime = getEndDateTime(params)
    db = QtGui.qApp.db
    stmt = u"""
    select
        Event.id as eventId,
        Diagnosis.MKB,
        age(Client.birthDate, Action.begDate) as clientAge,
        age(Client.birthDate, ActionReceived.begDate) as clientAgeReceived,
        ActionReceived.begDate,
        Action.endDate,
        APWhatIsDeliver.value as whatIsDeliver,
        if(Event.order = 2, 1, 0) as urgentReading,
        if(APUrgentReadingAction.value is not null, 1, 0) as urgentReadingAction,
        if(rbResult.regionalCode = '105', 1, 0) as outDeath,
        if(EventDeath.isPrimary = 1, 1, 0) as autopsy,
        if(EventDeath.isAutopsyType = 1, 1, 0) as forensicMedicineAutopsy,
        if(rbResultDeath.name like 'расхождение%%', 1, 0) as divergenceDiagnosis,
        (select Diagnosis.MKB
            from Diagnostic
                inner join Diagnosis on Diagnostic.`diagnosis_id`=Diagnosis.`id`
                inner join rbDiagnosisType on Diagnostic.`diagnosisType_id`=rbDiagnosisType.`id`
            where Diagnostic.event_id = EventDeath.id
                and rbDiagnosisType.code = '42'
            limit 1
        ) as constDeathMKB
    from Action
        inner join Event on Event.id = Action.event_id
        inner join EventType on EventType.id = Event.eventType_id
        inner join rbMedicalAidType on rbMedicalAidType.id = EventType.medicalAidType_id
        inner join Client on Client.id = Event.client_id
        inner join Diagnostic on Diagnostic.event_id = Event.id
        inner join Diagnosis on Diagnosis.id = Diagnostic.diagnosis_id
        inner join rbDiagnosisType on rbDiagnosisType.id = Diagnostic.diagnosisType_id
        left join rbResult on rbResult.id = Event.result_id
        inner join Action as ActionReceived on ActionReceived.id = COALESCE(
            (
                SELECT A.id
                FROM Action AS A
                INNER JOIN ActionType AS AT ON AT.id = A.actionType_id
                WHERE A.event_id = Event.id
                    AND A.deleted = 0
                    AND AT.flatCode LIKE 'received%%'
                ORDER BY A.begDate
                LIMIT 1
            ),
            (
                SELECT A.id
                FROM Action AS A
                INNER JOIN ActionType AS AT ON AT.id = A.actionType_id
                WHERE A.event_id = GetFirstEventId(Event.id)
                    AND A.deleted = 0
                    AND AT.flatCode LIKE 'received%%'
                ORDER BY A.begDate
                LIMIT 1
            )
        )
        inner join Action as ActionMoving on ActionMoving.id = (
            select A.id
            from Action as A
                inner join ActionType as AT on AT.id = A.actionType_id
            where A.event_id = Event.id
                and A.deleted = 0
                and AT.flatCode like 'moving%%'
            order by A.begDate desc
            limit 1
        )
        left join ActionProperty_String as APWhatIsDeliver on APWhatIsDeliver.id = (
            select AP.id
            from ActionProperty as AP 
                inner join ActionPropertyType as APT on APT.id = AP.type_id
                inner join ActionProperty_String AS AP_S ON AP_S.id = AP.id
            where AP.deleted = 0
                and APT.deleted = 0
                and AP.action_id = ActionReceived.id
                and APT.name = 'Кем доставлен'
                and trim(AP_S.value) != ''
            order by AP.id desc
            limit 1
        )
        left join ActionProperty_String as APUrgentReadingAction on APUrgentReadingAction.id = (
            select AP.id
            from ActionProperty as AP 
                inner join ActionPropertyType as APT on APT.id = AP.type_id
                inner join ActionProperty_String AS AP_S ON AP_S.id = AP.id
            where AP.deleted = 0
                and APT.deleted = 0
                and AP.action_id = ActionReceived.id
                and APT.name = 'Доставлен по'
                and AP_S.value like '%%экстренным показаниям%%'
            order by AP.id desc
            limit 1
        )
        left join ActionProperty_String as APResult on APResult.id = (
            select AP.id
            from ActionProperty as AP 
                inner join ActionPropertyType as APT on APT.id = AP.type_id
                inner join ActionProperty_String AS AP_S ON AP_S.id = AP.id
            where AP.deleted = 0
                and APT.deleted = 0
                and AP.action_id = Action.id
                and APT.name = 'Исход госпитализации'
            order by AP.id desc
            limit 1
        )
        left join Event as EventDeath on EventDeath.id = (
            select E.id
            from Event as E
                inner join EventType as ET on ET.id = E.eventType_id
                inner join rbEventTypePurpose as ETP on ETP.id = ET.purpose_id
            where E.client_id = Client.id
                and E.deleted = 0
                and ET.deleted = 0
                and ETP.code = 5
                and ET.code in (15, 23)
            limit 1
        )
        left join rbResult as rbResultDeath ON rbResultDeath.id = EventDeath.result_id
        %(join)s
    where Action.deleted = 0
        and Action.actionType_id in (%(actionTypeIdList)s)
        and Event.deleted = 0
        and EventType.deleted = 0
        and Client.deleted = 0
        and Diagnostic.deleted = 0
        and Diagnosis.deleted = 0
        and ActionReceived.id is not null
        and Action.endDate is not null
        and rbMedicalAidType.regionalCode in ('11', '12', '401', '402')
        and (Action.begDate is null or Action.begDate between %(begDate)s and %(endDate)s)
        and (rbDiagnosisType.code = '1'
            or (rbDiagnosisType.code = '2'
                and Diagnostic.person_id = Event.execPerson_id
                and NOT EXISTS (SELECT DC.id FROM Diagnostic AS DC INNER JOIN rbDiagnosisType AS DT ON DT.id = DC.diagnosisType_id WHERE DT.code = '1' AND DC.event_id = Event.id LIMIT 1)
            )
        )
        and coalesce(APResult.value, '') not like '%%переведен в другой стационар%%'
        and %(cond)s
    """
    join = []
    cond = []
    actionTypeIdList = getActionTypeIdListByFlatCode(u'leaved%')
    if orgStructureIdList:
        cond.append(getOrgStructureProperty(u'Отделение', orgStructureIdList))
    socStatusClassId = params.get('socStatusClassId', None)
    socStatusTypeId = params.get('socStatusTypeId', None)
    socStatusCond = []
    if socStatusClassId:
        socStatusCond.append('ClientSocStatus.socStatusClass_id = %d' % socStatusClassId)
    if socStatusTypeId:
        socStatusCond.append('ClientSocStatus.socStatusType_id = %d' % socStatusTypeId)
    if socStatusCond:
        socStatusCond = db.joinAnd(socStatusCond)
        cond.append(u"""exists (
            select *
            from ClientSocStatus
            where ClientSocStatus.client_id = Client.id
                and ClientSocStatus.deleted = 0
                and (ClientSocStatus.begDate is null or ClientSocStatus.begDate <= %(endDate)s)
                and (ClientSocStatus.endDate is null or ClientSocStatus.endDate >= %(begDate)s)
                %(cond)s
        )""" % {
            'begDate': db.formatDate(begDateTime),
            'endDate': db.formatDate(endDateTime),
            'cond': socStatusCond
        })
    if ageGroup == AgeGroup.Adult:
        cond.append(u'age(Client.birthDate, Action.begDate) >= 18')
    elif ageGroup == AgeGroup.Senior:
        maleAge, femaleAge = getRetirementAge(begDateTime)
        cond.append(u'(Client.sex = 1 and age(Client.birthDate, Action.begDate) >= %d) or (Client.sex = 2 and age(Client.birthDate, Action.begDate) >= %d)' % (maleAge, femaleAge))
    elif ageGroup == AgeGroup.Children:
        cond.append(u'age(Client.birthDate, ActionReceived.begDate) < 18')
    if financeId:
        join.append('inner join Contract on Contract.id = Event.contract_id and Contract.deleted = 0')
        cond.append(u'Contract.finance_id = %d' % financeId)
    if eventOrder == 2:
        cond.append(u'Event.order = 2')
    elif eventOrder == 1:
        cond.append(u'APUrgentReadingAction.value is not null')
    return db.query(stmt % {
        'actionTypeIdList': ','.join([str(id) for id in actionTypeIdList]),
        'join': ' '.join(join),
        'cond': db.joinAnd(cond),
        'begDate': db.formatDate(begDateTime),
        'endDate': db.formatDate(endDateTime)
    })


def selectDataOperation(params, orgStructureIdList, ageGroup=None):
    orgStructureId = params.get('orgStructureId', None)
    financeId = params.get('financeId', None)
    begDateTime = getBegDateTime(params)
    endDateTime = getEndDateTime(params)
    db = QtGui.qApp.db
    stmt = u"""
    select
        Action.id as actionId,
        Action.endDate as actionEndDate,
        Client.id as clientId,
        age(Client.birthDate, Action.endDate) as clientAge,
        Client.sex as clientSex,
        APOperationDevGroup.value as operationDevGroup,
        CASE WHEN VOperationType.id IS NOT NULL THEN
          VOperationType.code
        WHEN VOperationType.id IS NULL AND ActionType.flatCode = 'oper_pdf' AND APSOperationType.value != '' THEN
          APSOperationType.value
        END as operationTypeCode,
        (ActionType.flatCode = 'oper_pdf' and rbMedicalAidType.regionalCode in ('401', '402')) as isVMT,
        (APComplication.value is not null) as isComplication,
        (APLeavedResult.value = 'умер' or rbResult.code = '105') as isResultDeath,
        (APMKBAfterOperation.value between 'C00' and 'C97.99') as isOncology,
        (trim(APSurgicalPreparation.value) != '') as isMorphologicalStudy
    from Action
        inner join ActionType on ActionType.id = Action.actionType_id
        inner join Event on Event.id = Action.event_id
        inner join EventType on EventType.id = Event.eventType_id
        left join rbResult on rbResult.id = Event.result_id
        inner join rbMedicalAidType on rbMedicalAidType.id = EventType.medicalAidType_id
        inner join Client on Client.id = Event.client_id
        left join Person on Person.id = Action.person_id
        left join Action as ActionLeaved on ActionLeaved.id = (
            select A.id
            from Action as A
                inner join ActionType as AT on AT.id = A.actionType_id
            where A.event_id = Event.id
                and A.deleted = 0
                and AT.flatCode like 'leaved%%'
                and A.endDate is not null
            order by A.id desc
            limit 1
        )
        left join ActionProperty_String as APOperationDevGroup on APOperationDevGroup.id = (
            select AP.id
            from ActionProperty as AP 
                inner join ActionPropertyType as APT on APT.id = AP.type_id
                inner join ActionProperty_String AS AP_S ON AP_S.id = AP.id
            where AP.deleted = 0
                and APT.deleted = 0
                and AP.action_id = Action.id
                and APT.name = 'Использованная аппаратура'
                and trim(AP_S.value) != ''
            order by AP.id desc
            limit 1
        )
        LEFT JOIN ActionProperty_String APSOperationType ON APSOperationType.id = (
             select AP.id
            from ActionProperty as AP 
                inner join ActionPropertyType as APT on APT.id = AP.type_id
            where AP.deleted = 0
                and APT.deleted = 0
                and AP.action_id = Action.id
                and APT.name = 'Тип операции'
            order by AP.id desc
            limit 1 
        )
        left join ActionProperty_Integer as APOperationType on APOperationType.id = (
            select AP.id
            from ActionProperty as AP 
                inner join ActionPropertyType as APT on APT.id = AP.type_id
            where AP.deleted = 0
                and APT.deleted = 0
                and AP.action_id = Action.id
                and APT.name = 'Тип операции'
            order by AP.id desc
            limit 1
        )
        left join `v1.2.643.5.1.13.13.11.1359` as VOperationType on VOperationType.id = APOperationType.value
        left join ActionProperty_Integer as APComplication on APComplication.id = (
            select AP.id
            from ActionProperty as AP 
                inner join ActionPropertyType as APT on APT.id = AP.type_id
            where AP.deleted = 0
                and APT.deleted = 0
                and AP.action_id = Action.id
                and APT.name in ('Интраоперационное осложнение', 'Осложнен.операции у матери', 'Осложнения')
            order by AP.id desc
            limit 1
        )
        left join ActionProperty_String as APLeavedResult on APLeavedResult.id = (
            select AP.id
            from ActionProperty as AP 
                inner join ActionPropertyType as APT on APT.id = AP.type_id
            where AP.deleted = 0
                and APT.deleted = 0
                and AP.action_id = ActionLeaved.id
                and APT.name = 'Исход госпитализации'
            order by AP.id desc
            limit 1
        )
        left join ActionProperty_MKB as APMKBAfterOperation on APMKBAfterOperation.id = (
            select AP.id
            from ActionProperty as AP 
                inner join ActionPropertyType as APT on APT.id = AP.type_id
            where AP.deleted = 0
                and APT.deleted = 0
                and AP.action_id = Action.id
                and APT.name = 'МКБ Основной диагноз после операции'
            order by AP.id desc
            limit 1
        )
        left join ActionProperty_String as APSurgicalPreparation on APSurgicalPreparation.id = (
            select AP.id
            from ActionProperty as AP 
                inner join ActionPropertyType as APT on APT.id = AP.type_id
            where AP.deleted = 0
                and APT.deleted = 0
                and AP.action_id = Action.id
                and APT.name = 'Макропрепарат'
            order by AP.id desc
            limit 1
        )
        %(join)s
    where Action.deleted = 0
        and Action.actionType_id in (%(actionTypeIdList)s)
        and Event.deleted = 0
        and EventType.deleted = 0
        and Client.deleted = 0
        and rbMedicalAidType.regionalCode in ('11', '12', '401', '402')
        and Action.endDate between %(begDate)s and %(endDate)s
        and ActionLeaved.id is not null
        and %(cond)s
    """
    join = []
    cond = []
    actionTypeIdList = getActionTypeIdListByFlatCode([u'oper_pdf', u'kesarevo', u'vacuum'])
    if orgStructureIdList:
        cond.append(u'Person.orgStructure_id in (%s)' % ','.join([str(id) for id in orgStructureIdList]))
    socStatusClassId = params.get('socStatusClassId', None)
    socStatusTypeId = params.get('socStatusTypeId', None)
    socStatusCond = []
    if socStatusClassId:
        socStatusCond.append('ClientSocStatus.socStatusClass_id = %d' % socStatusClassId)
    if socStatusTypeId:
        socStatusCond.append('ClientSocStatus.socStatusType_id = %d' % socStatusTypeId)
    if socStatusCond:
        socStatusCond = db.joinAnd(socStatusCond)
        cond.append(u"""exists (
            select *
            from ClientSocStatus
            where ClientSocStatus.client_id = Client.id
                and ClientSocStatus.deleted = 0
                and (ClientSocStatus.begDate is null or ClientSocStatus.begDate <= %(endDate)s)
                and (ClientSocStatus.endDate is null or ClientSocStatus.endDate >= %(begDate)s)
                %(cond)s
        )""" % {
            'begDate': db.formatDate(begDateTime),
            'endDate': db.formatDate(endDateTime),
            'cond': socStatusCond
        })
    if financeId:
        join.append('inner join Contract on Contract.id = Event.contract_id and Contract.deleted = 0')
        cond.append(u'Contract.finance_id = %d' % financeId)
    if ageGroup == AgeGroup.Senior:
        maleAge, femaleAge = getRetirementAge(begDateTime)
        cond.append(u'(Client.sex = 1 and age(Client.birthDate, Action.begDate) >= %d) or (Client.sex = 2 and age(Client.birthDate, Action.begDate) >= %d)' % (maleAge, femaleAge))
    return db.query(stmt % {
        'actionTypeIdList': ','.join([str(id) for id in actionTypeIdList]),
        'join': ' '.join(join),
        'cond': db.joinAnd(cond),
        'begDate': db.formatDate(begDateTime),
        'endDate': db.formatDate(endDateTime)
    })


class CStationaryF14SetupDialog(QtGui.QDialog, Ui_StationaryF14SetupDialog):
    def __init__(self, parent=None):
        QtGui.QDialog.__init__(self, parent)
        self.setupUi(self)
        self.cmbOrgStructure.setOrgId(QtGui.qApp.currentOrgId())
        self.cmbOrgStructure.setValue(QtGui.qApp.currentOrgStructureId())
        self.cmbFinance.setTable('rbFinance', addNone=True)
        self.cmbSocStatusClass.setTable('rbSocStatusClass', True)
        self.cmbSocStatusType.setTable('rbSocStatusType', True)
        self.lblSelectActionType.setVisible(True)
        self.cmbSelectActionType.setVisible(True)
        self.setSelectIsTypeOS(False)
        self.setMedicalAidTypeVisible(False)
        self.setTypeSurgeryVisible(True)
        self.setExistFlatCodeVisible(False)


    def setTitle(self, title):
        self.setWindowTitle(title)


    def setExistFlatCodeVisible(self, visible = False):
        self.isExistFlatCodeVisible = visible
        self.chkExistFlatCode.setVisible(visible)


    def setSelectActionTypeVisible(self, visible = False):
        self.lblSelectActionType.setVisible(visible)
        self.cmbSelectActionType.setVisible(visible)


    def setSelectIsTypeOS(self, visible = False):
        self.typeOSVisible = visible
        self.lblIsTypeOS.setVisible(visible)
        self.cmbIsTypeOS.setVisible(visible)


    def setItemsTypeSurgery(self, typeList):
        if self.typeSurgeryVisible:
            self.cmbTypeSurgery.insertItems(2, typeList)


    def setMedicalAidTypeVisible(self, visible = False):
        self.chkMedicalAidTypeVisible = visible
        self.chkMedicalAidType.setVisible(visible)


    def setTypeSurgeryVisible(self, visible = False):
        self.typeSurgeryVisible = visible
        self.lblTypeSurgery.setVisible(visible)
        self.cmbTypeSurgery.setVisible(visible)


    def setFinanceVisible(self, visible = False):
        self.lblFinance.setVisible(visible)
        self.cmbFinance.setVisible(visible)


    def setSpecialDeliverClientVisible(self, visible = False):
        self.lblSpecialDeliverClient.setVisible(visible)
        self.cmbSpecialDeliverClient.setVisible(visible)


    def setParams(self, params):
        self.edtBegDate.setDate(params.get('begDate', QDate.currentDate()))
        self.edtBegTime.setTime(params.get('begTime', QTime(9, 0, 0, 0)))
        self.edtEndDate.setDate(params.get('endDate', QDate.currentDate()))
        self.edtTimeEdit.setTime(params.get('endTime', QTime(9, 0, 0, 0)))
        self.cmbOrgStructure.setValue(params.get('orgStructureId', None))
        self.cmbSpecialDeliverClient.setCurrentIndex(params.get('eventOrder', 0))
        self.cmbFinance.setValue(params.get('financeId', None))
        if self.typeSurgeryVisible:
            self.cmbTypeSurgery.setCurrentIndex(params.get('typeSurgery', 0))
        self.cmbSelectActionType.setCurrentIndex(params.get('selectActionType', 0))
        self.cmbSocStatusClass.setValue(params.get('socStatusClassId', None))
        self.cmbSocStatusType.setValue(params.get('socStatusTypeId', None))
        if self.typeOSVisible:
            self.cmbIsTypeOS.setCurrentIndex(params.get('isTypeOS', 0))
        if self.chkMedicalAidTypeVisible:
            self.chkMedicalAidType.setChecked(params.get('isMedicalAidType', True))
        if self.isExistFlatCodeVisible:
            self.chkExistFlatCode.setChecked(params.get('existFlatCode', False))


    def params(self):
        def getPureHMTime(time):
            return QTime(time.hour(), time.minute())
        result = {}
        result['begDate'] = self.edtBegDate.date()
        result['begTime'] = getPureHMTime(self.edtBegTime.time())
        result['endDate'] = self.edtEndDate.date()
        result['endTime'] = getPureHMTime(self.edtTimeEdit.time())
        result['orgStructureId'] = self.cmbOrgStructure.value()
        result['eventOrder'] = self.cmbSpecialDeliverClient.currentIndex()
        result['financeId'] = self.cmbFinance.value()
        if self.typeSurgeryVisible:
            result['typeSurgery'] = self.cmbTypeSurgery.currentIndex()
        result['selectActionType'] = self.cmbSelectActionType.currentIndex()
        result['socStatusClassId'] = self.cmbSocStatusClass.value()
        result['socStatusTypeId'] = self.cmbSocStatusType.value()
        if self.typeOSVisible:
            result['isTypeOS'] = self.cmbIsTypeOS.currentIndex()
        if self.chkMedicalAidTypeVisible:
            result['isMedicalAidType'] = self.chkMedicalAidType.isChecked()
        if self.isExistFlatCodeVisible:
            result['existFlatCode'] = self.chkExistFlatCode.isChecked()
        return result


class CStationaryF14KK(CReport):
    def __init__(self, parent):
        CReport.__init__(self, parent)
        self.setTitle(u'Форма № 14')
        self.stationaryF14SetupDialog = None
        self.orientation = CPageFormat.Landscape


    def getSetupDialog(self, parent):
        result = CStationaryF14SetupDialog(parent)
        self.stationaryF14SetupDialog = result
        return result


    def dumpParams(self, cursor, params):
        description = []
        begDate = params.get('begDate', QDate())
        begDateTime = getBegDateTime(params)
        endDateTime = getEndDateTime(params)
        if not begDate:
            description.append(u'Текущий день: ' + forceString(endDateTime))
        elif begDateTime.date() or endDateTime.date():
            description.append(dateRangeAsStr(u'за период', begDateTime, endDateTime))
        eventOrder = params.get('eventOrder', 0)
        orgStructureId = params.get('orgStructureId', None)
        if orgStructureId:
            description.append(u'подразделение: ' + getOrgStructureFullName(orgStructureId))
        else:
            description.append(u'подразделение: ЛПУ')
        if eventOrder == 2:
            description.append(u'учет экстренных пациентов '+ u'по атрибуту События "экстренно"')
        elif eventOrder == 1:
            description.append(u'учет экстренных пациентов '+ u'по свойству "Доставлен по экстренным показаниям"')
        financeId = params.get('financeId', None)
        description.append(u'тип финансирования: %s'%(forceString(QtGui.qApp.db.translate('rbFinance', 'id', financeId, 'name')) if financeId else u'не задано'))
        socStatusClassId = params.get('socStatusClassId', None)
        if socStatusClassId:
            description.append(u'класс соц.статуса: %s'%(forceString(QtGui.qApp.db.translate('rbSocStatusClass', 'id', socStatusClassId, 'name'))))
        socStatusTypeId  = params.get('socStatusTypeId', None)
        if socStatusTypeId:
            description.append(u'тип соц.статуса: %s'%(forceString(QtGui.qApp.db.translate('rbSocStatusType', 'id', socStatusTypeId, 'name'))))
        if self.stationaryF14SetupDialog.cmbTypeSurgery.isVisible():
            description.append(u'учет операций: %s'%([u'номенклатурный', u'пользовательский'][params.get('typeSurgery', 0)]))
        selectActionType = params.get('selectActionType', 0)
        description.append(u'отбор по %s'%([u'операциям', u'поступлению', u'движению', u'выписке', u'выписке+внешним Событиям'][selectActionType]))
        isTypeOs = params.get('isTypeOS', 0)
        if isTypeOs:
            description.append(u'стационар: %s'%([u'не задано', u'круглосуточный', u'дневной'][isTypeOs]))
        isMedicalAidType = params.get('isMedicalAidType', 0)
        if isMedicalAidType:
            description.append(u'учитывать только %s события'%([u'', u'стационарные'][isMedicalAidType]))
        existFlatCode = params.get('existFlatCode', 0)
        if existFlatCode:
            description.append(u'учитывать только заполненный "код для отчетов"')
        description.append(u'отчёт составлен: '+forceString(QDateTime.currentDateTime()))
        columns = [ ('100%', [], CReportBase.AlignLeft) ]
        table = createTable(cursor, columns, headerRowCount=len(description), border=0, cellPadding=2, cellSpacing=0)
        for i, row in enumerate(description):
            table.setText(i, 0, row)
        cursor.movePosition(QtGui.QTextCursor.End)
        cursor.insertBlock()


    def getOrgStructureIdList(self, params):
        orgStructureId = params.get('orgStructureId', None)
        if orgStructureId:
            orgStructureIndex = self.stationaryF14SetupDialog.cmbOrgStructure._model.index(self.stationaryF14SetupDialog.cmbOrgStructure.currentIndex(), 0, self.stationaryF14SetupDialog.cmbOrgStructure.rootModelIndex())
            treeItem = orgStructureIndex.internalPointer() if orgStructureIndex.isValid() else None
            if treeItem:
                return treeItem.getItemIdList()
        return None


    def dataReceivedMKB(self, eventId):
        db = QtGui.qApp.db
        tableActionType = db.table('ActionType')
        tableAction = db.table('Action')
        tableEvent = db.table('Event')
        queryTable = tableActionType.innerJoin(tableAction, tableActionType['id'].eq(tableAction['actionType_id']))
        queryTable = queryTable.innerJoin(tableEvent, tableAction['event_id'].eq(tableEvent['id']))
        eventList = set(db.getTheseAndParents(tableEvent, 'prevEvent_id', [eventId]))
        cond = [tableActionType['flatCode'].like('received%'),
                tableAction['deleted'].eq(0),
                tableEvent['deleted'].eq(0),
                tableEvent['id'].inlist(eventList),
                tableActionType['deleted'].eq(0),
                tableAction['actionType_id'].eq(tableActionType['id'])
               ]
        return db.getRecordEx(queryTable, [tableAction['begDate']], cond)


class CStationaryF14KK2000(CStationaryF14KK):
    def getSetupDialog(self, parent):
        result = CStationaryF14SetupDialog(parent)
        self.stationaryF14SetupDialog = result
        self.stationaryF14SetupDialog.cmbTypeSurgery.setVisible(False)
        self.stationaryF14SetupDialog.lblTypeSurgery.setVisible(False)
        return result


class CStationaryF14KK2000Adult(CStationaryF14KK2000):
    def build(self, params):
        ageGroup = AgeGroup.Adult
        mkbCodes = [getMkbCodes(row, ageGroup) for row in Rows2000]
        mapRows2000 = createMapCodeToRowIdx(mkbCodes)
        rowSize = 9
        reportData2000 = [[0]*rowSize for row in xrange(len(Rows2000))]
        eventIdSet = set()
        orgStructureIdList = self.getOrgStructureIdList(params)
        query = selectDataLeavedMkb(params, ageGroup, orgStructureIdList)
        while query.next():
            record = query.record()
            eventId = forceRef(record.value('eventId'))
            if eventId not in eventIdSet:
                eventIdSet.add(eventId)
                whatIsDeliver = forceString(record.value('whatIsDeliver'))
                emergencyCall = 1 if u'СМП'.lower() in whatIsDeliver.lower() else 0
                urgentReading = forceBool(record.value('urgentReading'))
                urgentReadingAction = forceBool(record.value('urgentReadingAction'))
                outDeath = forceBool(record.value('outDeath'))
                MKB = forceString(record.value('MKB'))
                constDeathMKB = forceString(record.value('constDeathMKB'))
                begDate = forceDate(record.value('begDate'))
                endDate = forceDate(record.value('endDate'))
                if not outDeath:
                    for row in mapRows2000.get(MKB, []):
                        reportLine = reportData2000[row]
                        reportLine[0] += 1
                        if urgentReading or urgentReadingAction:
                            reportLine[1] += 1
                        if emergencyCall:
                            reportLine[2] += 1  #Поступление: Кем доставлен - СМП
                        if begDate:
                            days = begDate.daysTo(endDate) if begDate != endDate else 1
                            reportLine[3] += days
                else:
                    deathMKB = constDeathMKB or MKB
                    isAutopsy = forceBool(record.value('autopsy'))
                    forensicMedicineAutopsy = forceBool(record.value('forensicMedicineAutopsy'))
                    divergenceDiagnosis = forceBool(record.value('divergenceDiagnosis'))
                    for row in mapRows2000.get(deathMKB, []):
                        reportLine = reportData2000[row]
                        reportLine[4] += 1
                        if isAutopsy:
                            if not forensicMedicineAutopsy:
                                reportLine[5] += 1
                                if divergenceDiagnosis:
                                    reportLine[6] += 1
                            else:
                                reportLine[7] += 1
                                if divergenceDiagnosis:
                                    reportLine[8] += 1
        doc = QtGui.QTextDocument()
        cursor = QtGui.QTextCursor(doc)
        cursor.setCharFormat(CReportBase.ReportTitle)
        cursor.insertText(u'1.Состав пациентов в стационаре, сроки и исходы лечения\n(2000)')
        cursor.insertBlock()
        self.dumpParams(cursor, params)
        cursor.setCharFormat(CReportBase.ReportBody)
        cursor.insertBlock()
        cols = [('15%',[u'Наименование болезни', u'', u'', u'', u'1'], CReportBase.AlignLeft),
                ('5%', [u'№ строки', u'', u'', u'', u'2'], CReportBase.AlignCenter),
                ('5%', [u'Код по МКБ-10', u'', u'', u'', u'3'], CReportBase.AlignCenter),
                ('8.3%', [u'А. Взрослые (18 лет и более)', u'Выписано пациентов', u'Всего, чел', u'', u'4'], CReportBase.AlignRight),
                ('8.3%', [u'', u'', u'из них доставленных по экстренным показаниям', u'', u'5'], CReportBase.AlignRight),
                ('8.3%', [u'', u'', u'из них пациентов, доставленных скорой мед. помощью (из гр. 5)', u'', u'6'], CReportBase.AlignRight),
                ('8.3%', [u'', u'Проведено выписанными койко-дней, койк. дн.', u'', u'', u'7'], CReportBase.AlignRight),
                ('8.3%', [u'', u'Умерло', u'Всего, чел', u'', u'8'], CReportBase.AlignRight),
                ('8.3%', [u'', u'', u'из них', u'проведено патологоанатомических вскрытий', u'9'], CReportBase.AlignRight),
                ('8.3%', [u'', u'', u'', u'из них установлено расхождений диагнозов', u'10'], CReportBase.AlignRight),
                ('8.3%', [u'', u'', u'', u'проведено судебно-медицинских вскрытий', u'11'], CReportBase.AlignRight),
                ('8.3%', [u'', u'', u'', u'из них установлено расхождений диагнозов', u'12'], CReportBase.AlignRight),
                ]
        table = createTable(cursor, cols)
        table.mergeCells(0, 0, 4, 1) # 1
        table.mergeCells(0, 1, 4, 1) # 2
        table.mergeCells(0, 2, 4, 1) # 3
        table.mergeCells(0, 3, 1, 9) # 4
        table.mergeCells(1, 3, 1, 3)
        table.mergeCells(1, 6, 3, 1)
        table.mergeCells(2, 3, 2, 1)
        table.mergeCells(2, 4, 2, 1)
        table.mergeCells(2, 5, 2, 1)
        table.mergeCells(1, 7, 1, 5)
        table.mergeCells(2, 7, 2, 1)
        table.mergeCells(2, 8, 1, 4)
        for row, rowDescr in enumerate(Rows2000):
            reportLine = reportData2000[row]
            i = table.addRow()
            table.setText(i, 0, rowDescr[0])
            table.setText(i, 1, rowDescr[1])
            table.setText(i, 2, getMkbCodes(rowDescr, ageGroup))
            for colIndex in xrange(rowSize):
                colNumber = 4 + colIndex
                excludedCols = ExcludeCells2000.get(rowDescr[1])
                if excludedCols and colNumber in excludedCols:
                    table.setText(i, 3 + colIndex, 'X')
                else:
                    table.setText(i, 3 + colIndex, reportLine[colIndex])
        cursor.movePosition(QtGui.QTextCursor.End)
        return doc


class CStationaryF14KK2000Senior(CStationaryF14KK2000):
    def build(self, params):
        ageGroup = AgeGroup.Senior
        mkbCodes = [getMkbCodes(row, ageGroup) for row in Rows2000]
        mapRows2000 = createMapCodeToRowIdx(mkbCodes)
        rowSize = 9
        reportData2000 = [[0]*rowSize for row in xrange(len(Rows2000))]
        eventIdSet = set()
        orgStructureIdList = self.getOrgStructureIdList(params)
        query = selectDataLeavedMkb(params, ageGroup, orgStructureIdList)
        while query.next():
            record = query.record()
            eventId = forceRef(record.value('eventId'))
            if eventId not in eventIdSet:
                eventIdSet.add(eventId)
                whatIsDeliver = forceString(record.value('whatIsDeliver'))
                emergencyCall = 1 if u'СМП'.lower() in whatIsDeliver.lower() else 0
                urgentReading = forceBool(record.value('urgentReading'))
                urgentReadingAction = forceBool(record.value('urgentReadingAction'))
                outDeath = forceBool(record.value('outDeath'))
                MKB = forceString(record.value('MKB'))
                constDeathMKB = forceString(record.value('constDeathMKB'))
                begDate = forceDate(record.value('begDate'))
                endDate = forceDate(record.value('endDate'))
                if not outDeath:
                    for row in mapRows2000.get(MKB, []):
                        reportLine = reportData2000[row]
                        reportLine[0] += 1
                        if urgentReading or urgentReadingAction:
                            reportLine[1] += 1
                        if emergencyCall:
                            reportLine[2] += 1  #Поступление: Кем доставлен - СМП
                        if begDate:
                            days = begDate.daysTo(endDate) if begDate != endDate else 1
                            reportLine[3] += days
                else:
                    deathMKB = constDeathMKB or MKB
                    isAutopsy = forceBool(record.value('autopsy'))
                    forensicMedicineAutopsy = forceBool(record.value('forensicMedicineAutopsy'))
                    divergenceDiagnosis = forceBool(record.value('divergenceDiagnosis'))
                    for row in mapRows2000.get(deathMKB, []):
                        reportLine = reportData2000[row]
                        reportLine[4] += 1
                        if isAutopsy:
                            if not forensicMedicineAutopsy:
                                reportLine[5] += 1
                                if divergenceDiagnosis:
                                    reportLine[6] += 1
                            else:
                                reportLine[7] += 1
                                if divergenceDiagnosis:
                                    reportLine[8] += 1
        doc = QtGui.QTextDocument()
        cursor = QtGui.QTextCursor(doc)
        cursor.setCharFormat(CReportBase.ReportTitle)
        cursor.insertText(u'1.Состав пациентов в стационаре, сроки и исходы лечения\n(2000)')
        cursor.insertBlock()
        self.dumpParams(cursor, params)
        cursor.setCharFormat(CReportBase.ReportBody)
        cursor.insertBlock()
        cols = [('15%',[u'Наименование болезни', u'', u'', u'', u'1'], CReportBase.AlignLeft),
                ('5%', [u'№ строки', u'', u'', u'', u'2'], CReportBase.AlignCenter),
                ('5%', [u'Код по МКБ-10', u'', u'', u'', u'3'], CReportBase.AlignCenter),
                ('8.3%', [u'Б. Взрослые старше трудоспособного возраста', u'Выписано пациентов', u'Всего, чел', u'', u'13'], CReportBase.AlignRight),
                ('8.3%', [u'', u'', u'из них доставленных по экстренным показаниям', u'', u'14'], CReportBase.AlignRight),
                ('8.3%', [u'', u'', u'из них пациентов, доставленных скорой мед. помощью (из гр. 14)', u'', u'15'], CReportBase.AlignRight),
                ('8.3%', [u'', u'Проведено выписанными койко-дней, койк. дн.', u'', u'', u'16'], CReportBase.AlignRight),
                ('8.3%', [u'', u'Умерло', u'Всего, чел', u'', u'17'], CReportBase.AlignRight),
                ('8.3%', [u'', u'', u'из них', u'проведено патологоанатомических вскрытий', u'18'], CReportBase.AlignRight),
                ('8.3%', [u'', u'', u'', u'из них установлено расхождений диагнозов', u'19'], CReportBase.AlignRight),
                ('8.3%', [u'', u'', u'', u'проведено судебно-медицинских вскрытий', u'20'], CReportBase.AlignRight),
                ('8.3%', [u'', u'', u'', u'из них установлено расхождений диагнозов', u'21'], CReportBase.AlignRight),
                ]
        table = createTable(cursor, cols)
        table.mergeCells(0, 0, 4, 1) # 1
        table.mergeCells(0, 1, 4, 1) # 2
        table.mergeCells(0, 2, 4, 1) # 3
        table.mergeCells(0, 3, 1, 9) # 4
        table.mergeCells(1, 3, 1, 3)
        table.mergeCells(1, 6, 3, 1)
        table.mergeCells(2, 3, 2, 1)
        table.mergeCells(2, 4, 2, 1)
        table.mergeCells(2, 5, 2, 1)
        table.mergeCells(1, 7, 1, 5)
        table.mergeCells(2, 7, 2, 1)
        table.mergeCells(2, 8, 1, 4)
        for row, rowDescr in enumerate(Rows2000):
            reportLine = reportData2000[row]
            i = table.addRow()
            table.setText(i, 0, rowDescr[0])
            table.setText(i, 1, rowDescr[1])
            table.setText(i, 2, getMkbCodes(rowDescr, ageGroup))
            for colIndex in xrange(rowSize):
                colNumber = 13 + colIndex
                excludedCols = ExcludeCells2000.get(rowDescr[1])
                if excludedCols and colNumber in excludedCols:
                    table.setText(i, 3 + colIndex, 'X')
                else:
                    table.setText(i, 3 + colIndex, reportLine[colIndex])
        cursor.movePosition(QtGui.QTextCursor.End)
        return doc


class CStationaryF14KK2000Children(CStationaryF14KK2000):
    def getSetupDialog(self, parent):
        result = CStationaryF14SetupDialog(parent)
        self.stationaryF14SetupDialog = result
        self.stationaryF14SetupDialog.cmbTypeSurgery.setVisible(False)
        self.stationaryF14SetupDialog.lblTypeSurgery.setVisible(False)
        return result


    def build(self, params):
        ageGroup = AgeGroup.Children
        mkbCodes = [getMkbCodes(row, ageGroup) for row in Rows2000]
        mapRows2000 = createMapCodeToRowIdx(mkbCodes)
        rowSize = 12
        reportData2000 = [[0]*rowSize for row in xrange(len(Rows2000))]
        eventIdSet = set()
        orgStructureIdList = self.getOrgStructureIdList(params)
        query = selectDataLeavedMkb(params, ageGroup, orgStructureIdList)
        while query.next():
            record = query.record()
            eventId = forceRef(record.value('eventId'))
            if eventId not in eventIdSet:
                eventIdSet.add(eventId)
                whatIsDeliver = forceString(record.value('whatIsDeliver'))
                emergencyCall = 1 if u'СМП'.lower() in whatIsDeliver.lower() else 0
                urgentReading = forceBool(record.value('urgentReading'))
                urgentReadingAction = forceBool(record.value('urgentReadingAction'))
                outDeath = forceBool(record.value('outDeath'))
                MKB = forceString(record.value('MKB'))
                constDeathMKB = forceString(record.value('constDeathMKB'))
                begDate = forceDate(record.value('begDate'))
                endDate = forceDate(record.value('endDate'))
                clientAge = forceInt(record.value('clientAge'))
                if not outDeath:
                    for row in mapRows2000.get(MKB, []):
                        reportLine = reportData2000[row]
                        reportLine[0] += 1
                        if urgentReading or urgentReadingAction:
                            reportLine[1] += 1
                        if emergencyCall:
                            reportLine[2] += 1  #Поступление: Кем доставлен - СМП
                        if clientAge < 1:
                            reportLine[3] += 1
                        if begDate:
                            days = begDate.daysTo(endDate) if begDate != endDate else 1
                            reportLine[4] += days
                            if clientAge < 1:
                                reportLine[5] += 1
                else:
                    deathMKB = constDeathMKB or MKB
                    isAutopsy = forceBool(record.value('autopsy'))
                    forensicMedicineAutopsy = forceBool(record.value('forensicMedicineAutopsy'))
                    divergenceDiagnosis = forceBool(record.value('divergenceDiagnosis'))
                    for row in mapRows2000.get(deathMKB, []):
                        reportLine = reportData2000[row]
                        reportLine[6] += 1
                        if isAutopsy:
                            if not forensicMedicineAutopsy:
                                reportLine[7] += 1
                                if divergenceDiagnosis:
                                    reportLine[8] += 1
                            else:
                                reportLine[9] += 1
                                if divergenceDiagnosis:
                                    reportLine[10] += 1
                        if clientAge < 1:
                            reportLine[11] += 1
        doc = QtGui.QTextDocument()
        cursor = QtGui.QTextCursor(doc)
        cursor.setCharFormat(CReportBase.ReportTitle)
        cursor.insertText(u'1.Состав пациентов в стационаре, сроки и исходы лечения\n(2000)')
        cursor.insertBlock()
        self.dumpParams(cursor, params)
        cursor.setCharFormat(CReportBase.ReportBody)
        cursor.insertBlock()
        cols = [('18%',[u'Наименование болезни', u'', u'', u'', u'1'], CReportBase.AlignLeft),
                ('5%', [u'№ строки', u'', u'', u'', u'2'], CReportBase.AlignCenter),
                ('5%', [u'Код по МКБ-10', u'', u'', u'', u'3'], CReportBase.AlignCenter),
                ('6%', [u'В. Дети (в возрасте 0-17 лет включительно)', u'Выписано пациентов', u'Всего, чел', u'', u'22'], CReportBase.AlignRight),
                ('6%', [u'', u'', u'из них доставленных по экстренным показаниям', u'', u'23'], CReportBase.AlignRight),
                ('6%', [u'', u'', u'из них пациентов, доставленных скорой мед. помощью (из гр. 23)', u'', u'24'], CReportBase.AlignRight),
                ('6%', [u'', u'', u'из гр. 22 в возрасте до 1 года', u'', u'25'], CReportBase.AlignRight),
                ('6%', [u'', u'Проведено выписанными койко-дней, койк. дн.', u'', u'', u'26'], CReportBase.AlignRight),
                ('6%', [u'', u'из них (из гр. 26): в возрасте до 1 года', u'', u'', u'27'], CReportBase.AlignRight),
                ('6%', [u'', u'Умерло', u'Всего, чел', u'', u'28'], CReportBase.AlignRight),
                ('6%', [u'', u'', u'из них', u'Проведено патологоанатомических вскрытий', u'29'], CReportBase.AlignRight),
                ('6%', [u'', u'', u'', u'из них установлено расхождений диагнозов', u'30'], CReportBase.AlignRight),
                ('6%', [u'', u'', u'', u'проведено судебно-медицинских вскрытий', u'31'], CReportBase.AlignRight),
                ('6%', [u'', u'', u'', u'из них установлено расхождений диагнозов', u'32'], CReportBase.AlignRight),
                ('6%', [u'', u'', u'из гр. 28 умерло в возрасте до 1 года', u'', u'33'], CReportBase.AlignRight)
                ]
        table = createTable(cursor, cols)
        table.mergeCells(0, 0, 4, 1) # 1
        table.mergeCells(0, 1, 4, 1) # 2
        table.mergeCells(0, 2, 4, 1) # 3
        table.mergeCells(0, 3, 1, 12) # 4
        table.mergeCells(1, 3, 1, 4)
        table.mergeCells(2, 3, 2, 1)
        table.mergeCells(2, 4, 2, 1)
        table.mergeCells(2, 5, 2, 1)
        table.mergeCells(2, 6, 2, 1)
        table.mergeCells(1, 7, 3, 1)
        table.mergeCells(1, 8, 3, 1)
        table.mergeCells(1, 9, 1, 6)
        table.mergeCells(2, 9, 2, 1)
        table.mergeCells(2, 10, 1, 4)
        table.mergeCells(2, 14, 2, 1)
        for row, rowDescr in enumerate(Rows2000):
            reportLine = reportData2000[row]
            i = table.addRow()
            table.setText(i, 0, rowDescr[0])
            table.setText(i, 1, rowDescr[1])
            table.setText(i, 2, getMkbCodes(rowDescr, ageGroup))
            for colIndex in xrange(rowSize):
                colNumber = 22 + colIndex
                excludedCols = ExcludeCells2000.get(rowDescr[1])
                if excludedCols and colNumber in excludedCols:
                    table.setText(i, 3 + colIndex, 'X')
                else:
                    table.setText(i, 3 + colIndex, reportLine[colIndex])
        cursor.movePosition(QtGui.QTextCursor.End)
        return doc


class CStationaryF14KK4000(CStationaryF14KK):
    def getSetupDialog(self, parent):
        result = CStationaryF14SetupDialog(parent)
        self.stationaryF14SetupDialog = result
        return result


    def build(self, params):
        rowSize = 26
        mapRows4000 = createMapCodeToRowIdx4000(Rows4000)
        reportData4000 = [[0]*rowSize for _ in xrange(len(Rows4000))]
        orgStructureIdList = self.getOrgStructureIdList(params)
        query = selectDataOperation(params, orgStructureIdList)
        while query.next():
            record = query.record()
            clientAge = forceInt(record.value('clientAge'))
            operationTypeCode = forceString(record.value('operationTypeCode'))
            if operationTypeCode and not operationTypeCode.isdigit():
                partsOperationTypeCode = operationTypeCode.split('.', 1)
                operationTypeCode = partsOperationTypeCode[0] if partsOperationTypeCode else u''
            isVMT = forceBool(record.value('isVMT'))
            isComplication = forceBool(record.value('isComplication'))
            isResultDeath = forceBool(record.value('isResultDeath'))
            isOncology = forceBool(record.value('isOncology'))
            isMorphologicalStudy = forceBool(record.value('isMorphologicalStudy'))
            rows = [0] + mapRows4000.get(operationTypeCode, [])
            for row in rows:
                reportData = reportData4000[row]
                reportData[0] += 1  # 3. Число операций, проведенных в стационаре
                if 0 <= clientAge <= 14:
                    reportData[1] += 1  # 4. детям 0-14 лет включительно
                    if clientAge == 0:
                        reportData[2] += 1  # 5. детям до 1 года
                if 15 <= clientAge <= 17:
                    reportData[3] += 1  # 6. детям 15-17 лет включительно
                if isVMT:
                    reportData[4] += 1  # 7. операций с применением высоких медицинских технологий (ВМТ)
                    if 0 <= clientAge <= 14:
                        reportData[5] += 1  # 8. детям 0-14 лет включительно
                        if clientAge == 0:
                            reportData[6] += 1  # 9. детям до 1 года
                    if 15 <= clientAge <= 17:
                        reportData[7] += 1  # 10. детям 15-17 лет включительно
                if isComplication:
                    reportData[8] += 1  # 11. Число операций, при которых наблюдались осложнения в стационаре
                    if 0 <= clientAge <= 14:
                        reportData[9] += 1  # 12. детям 0-14 лет включительно
                        if clientAge == 0:
                            reportData[10] += 1  # 13. детям до 1 года
                    if 15 <= clientAge <= 17:
                        reportData[11] += 1  # 14. детям 15-17 лет включительно
                    if isVMT:
                        reportData[12] += 1  # 15. из них операций с применением ВМТ
                        if 0 <= clientAge <= 14:
                            reportData[13] += 1  # 16. детям 0-14 лет включительно
                            if clientAge == 0:
                                reportData[14] += 1  # 17. детям до 1 года
                        if 15 <= clientAge <= 17:
                            reportData[15] += 1  # 18. детям 15-17 лет включительно
                if isResultDeath:
                    reportData[16] += 1  # 19. Умерло оперированных в стационаре, чел.
                    if 0 <= clientAge <= 14:
                        reportData[17] += 1  # 20. детям 0-14 лет включительно
                        if clientAge == 0:
                            reportData[18] += 1  # 21. детям до 1 года
                    if 15 <= clientAge <= 17:
                        reportData[19] += 1  # 22. детям 15-17 лет включительно
                    if isVMT:
                        reportData[20] += 1  # 23. из них после операций с применением ВМТ
                        if 0 <= clientAge <= 14:
                            reportData[21] += 1  # 24. детям 0-14 лет включительно
                            if clientAge == 0:
                                reportData[22] += 1  # 25. детям до 1 года
                        if 15 <= clientAge <= 17:
                            reportData[23] += 1  # 26. детям 15-17 лет включительно
                if isOncology:
                    reportData[24] += 1  # 27. проведено операций по поводу злокачественных новообразований
                if isMorphologicalStudy:
                    reportData[25] += 1  # 28. направлено материалов на морфологическое исследование
        doc = QtGui.QTextDocument()
        cursor = QtGui.QTextCursor(doc)
        cursor.insertText(u'3.Хирургическая работа организации\n(4000)')
        cursor.insertText(u'(4100)')
        cursor.insertBlock()
        self.dumpParams(cursor, params)
        cursor.setCharFormat(CReportBase.ReportBody)
        cursor.insertBlock()
        cols = [('18%',[u'Наименование операции', u'', u'', u'1'], CReportBase.AlignLeft),
                ('4%', [u'№ строки', u'', u'', u'2'], CReportBase.AlignLeft),
                ('3%', [u'Число операций, проведенных в стационаре, ед.', u'всего', u'', u'3'], CReportBase.AlignLeft),
                ('3%', [u'', u'из них: детям 0-17 лет включительно', u'0-14 лет включительно', u'4'], CReportBase.AlignLeft),
                ('3%', [u'', u'', u'из гр.4 в возрасте до 1 года', u'5'], CReportBase.AlignLeft),
                ('3%', [u'', u'', u'15-17 лет включительно', u'6'], CReportBase.AlignLeft),
                ('3%', [u'из них: операций с применением высоких медицинских технологий (ВМТ), ед.',u'всего', u'', u'7'], CReportBase.AlignLeft),
                ('3%', [u'', u'из них: детям 0-17 лет включительно', u'0-14 лет включительно', u'8'], CReportBase.AlignLeft),
                ('3%', [u'', u'', u'из гр.8 в возрасте до 1 года', u'9'], CReportBase.AlignLeft),
                ('3%', [u'', u'', u'15-17 лет включительно', u'10'], CReportBase.AlignLeft),
                ('3%', [u'Число операций, при которых наблюдались осложнения в стационаре, ед.',u'всего', u'', u'11'], CReportBase.AlignLeft),
                ('3%', [u'', u'из них: детям 0-17 лет включительно', u'0-14 лет включительно', u'12'], CReportBase.AlignLeft),
                ('3%', [u'', u'', u'из гр.12 в возрасте до 1 года', u'13'], CReportBase.AlignLeft),
                ('3%', [u'', u'', u'15-17 лет включительно', u'14'], CReportBase.AlignLeft),
            ]
        table = createTable(cursor, cols)
        table.mergeCells(0, 0, 3, 1)
        table.mergeCells(0, 1, 3, 1)
        table.mergeCells(0, 2, 1, 4)
        table.mergeCells(1, 2, 2, 1)
        table.mergeCells(1, 3, 1, 3)
        table.mergeCells(0, 6, 1, 4)
        table.mergeCells(1, 6, 2, 1)
        table.mergeCells(1, 7, 1, 3)
        table.mergeCells(0, 10, 1, 4)
        table.mergeCells(1, 10, 2, 1)
        table.mergeCells(1, 11, 1, 3)
        for row, rowDescr in enumerate(Rows4000):
            reportData = reportData4000[row][0:12]
            i = table.addRow()
            table.setText(i, 0, rowDescr[0])
            table.setText(i, 1, rowDescr[2])
            for col, data in enumerate(reportData):
                table.setText(i, 2+col, data)
        cursor.movePosition(QtGui.QTextCursor.End)
            
        cols = [('18%',[u'Наименование операции', u'', u'', u'1'], CReportBase.AlignLeft),
                ('4%', [u'№ строки', u'', u'', u'2'], CReportBase.AlignLeft),
                ('3%', [u'из них после операций, с применением ВМТ, ед.',u'всего', u'', u'15'], CReportBase.AlignLeft),
                ('3%', [u'', u'из них: детям 0-17 лет включительно', u'0-14 лет включительно', u'16'], CReportBase.AlignLeft),
                ('3%', [u'', u'', u'из гр.16 в возрасте до 1 года', u'17'], CReportBase.AlignLeft),
                ('3%', [u'', u'', u'15-17 лет включительно', u'18'], CReportBase.AlignLeft),
                ('3%', [u'Умерло оперированных в стационаре, чел.',u'всего', u'', u'19'], CReportBase.AlignLeft),
                ('3%', [u'', u'из них: детям 0-17 лет включительно', u'0-14 лет включительно', u'20'], CReportBase.AlignLeft),
                ('3%', [u'', u'', u'из гр.20 в возрасте до 1 года', u'21'], CReportBase.AlignLeft),
                ('3%', [u'', u'', u'15-17 лет включительно', u'22'], CReportBase.AlignLeft),
                ('3%', [u'из них умерло после операций, проведенных с применением ВМТ',u'всего', u'', u'23'], CReportBase.AlignLeft),
                ('3%', [u'', u'из них: детям 0-17 лет включительно', u'0-14 лет включительно', u'24'], CReportBase.AlignLeft),
                ('3%', [u'', u'', u'из гр.24 в возрасте до 1 года', u'25'], CReportBase.AlignLeft),
                ('3%', [u'', u'', u'15-17 лет включительно', u'26'], CReportBase.AlignLeft),
                ('3%', [u'из гр.3 проведено операций по поводу злокачественных новообразований, ед.', u'', u'', u'27'], CReportBase.AlignLeft),
                ('3%', [u'из гр.3 направлено материалов на морфологическое исследование, ед.', u'', u'', u'28'], CReportBase.AlignLeft),
            ]
        table = createTable(cursor, cols)
        table.mergeCells(0, 0, 3, 1)
        table.mergeCells(0, 1, 3, 1)
        table.mergeCells(0, 2, 1, 4)
        table.mergeCells(1, 2, 2, 1)
        table.mergeCells(1, 3, 1, 3)
        table.mergeCells(0, 6, 1, 4)
        table.mergeCells(1, 6, 2, 1)
        table.mergeCells(1, 7, 1, 3)
        table.mergeCells(0, 10, 1, 4)
        table.mergeCells(1, 10, 2, 1)
        table.mergeCells(1, 11, 1, 3)
        table.mergeCells(0, 14, 3, 1)
        table.mergeCells(0, 15, 3, 1)
        for row, rowDescr in enumerate(Rows4000):
            reportData = reportData4000[row][12:rowSize]
            i = table.addRow()
            table.setText(i, 0, rowDescr[0])
            table.setText(i, 1, rowDescr[2])
            for col, data in enumerate(reportData):
                table.setText(i, 2+col, data)
        cursor.movePosition(QtGui.QTextCursor.End)

        return doc


class CStationaryF14KK4001(CStationaryF14KK):
    def getSetupDialog(self, parent):
        result = CStationaryF14SetupDialog(parent)
        self.stationaryF14SetupDialog = result
        return result


    def build(self, params):
        rowSize = 6
        mapRows4001 = createMapCodeToRowIdx4000(Rows4000)
        reportData4001 = [[0]*rowSize for _ in xrange(len(Rows4000))]
        orgStructureIdList = self.getOrgStructureIdList(params)
        query = selectDataOperation(params, orgStructureIdList, ageGroup=AgeGroup.Senior)
        while query.next():
            record = query.record()
            operationTypeCode = forceString(record.value('operationTypeCode'))
            isVMT = forceBool(record.value('isVMT'))
            isComplication = forceBool(record.value('isComplication'))
            isResultDeath = forceBool(record.value('isResultDeath'))
            rows = [0] + mapRows4001.get(operationTypeCode, [])
            for row in rows:
                reportData = reportData4001[row]
                reportData[0] += 1  # 3. Число операций, проведенных в стационаре
                if isVMT:
                    reportData[1] += 1  # 4. из них с применением высоких медицинских технологий (ВМТ)
                if isComplication:
                    reportData[2] += 1  # 5. Число операций, при которых наблюдались осложнения в стационаре
                    if isVMT:
                        reportData[3] += 1  # 6. из них операций с применением ВМТ
                if isResultDeath:
                    reportData[4] += 1  # 7. Умерло оперированных в стационаре, чел.
                    if isVMT:
                        reportData[5] += 1  # 8. из них после операций с применением ВМТ
        doc = QtGui.QTextDocument()
        cursor = QtGui.QTextCursor(doc)
        cursor.setCharFormat(CReportBase.ReportTitle)
        cursor.insertText(u'3.Хирургическая работа организации\n(лица трудоспособного возраста)\n(4001)')
        cursor.insertBlock()
        self.dumpParams(cursor, params)
        cursor.setCharFormat(CReportBase.ReportBody)
        cursor.insertBlock()
        cols = [('18%',[u'Наименование операции', u'', u'1'], CReportBase.AlignLeft),
                ('4%', [u'№ строки', u'', u'2'], CReportBase.AlignLeft),
                ('3%', [u'Число операций, проведенных в стационаре, ед.', u'Всего (из гр. 3 т. 4000)', u'3'], CReportBase.AlignLeft),
                ('3%', [u'', u'из них с применением высоких медицинских технологий (ВМТ) (из гр. 7 т. 4000)', u'', u'4'], CReportBase.AlignLeft),
                ('3%', [u'Число операций, при которых наблюдались осложнения в стационаре, ед', u'Всего (из гр. 11 т. 4000)', u'5'], CReportBase.AlignLeft),
                ('3%', [u'', u'из них: после операций с применением ВМТ (из гр. 15 т. 4000)', u'', u'6'], CReportBase.AlignLeft),
                ('3%', [u'Умерло оперированных в стационаре, чел', u'Всего (из гр. 19 т. 4000)', u'7'], CReportBase.AlignLeft),
                ('3%', [u'', u'из них умерло после операций, проведенных с применением ВМТ (из гр. 23 т. 4000)', u'', u'8'], CReportBase.AlignLeft),
            ]
        table = createTable(cursor, cols)
        table.mergeCells(0, 0, 2, 1)
        table.mergeCells(0, 1, 2, 1)
        table.mergeCells(0, 2, 1, 2)
        table.mergeCells(0, 4, 1, 2)
        table.mergeCells(0, 6, 1, 2)
        for row, rowDescr in enumerate(Rows4000):
            reportData = reportData4001[row][0:12]
            i = table.addRow()
            table.setText(i, 0, rowDescr[0])
            table.setText(i, 1, rowDescr[2])
            for col, data in enumerate(reportData):
                table.setText(i, 2+col, data)
        cursor.movePosition(QtGui.QTextCursor.End)

        return doc


class CStationaryF14KK4100(CStationaryF14KK):
    def getSetupDialog(self, parent):
        result = CStationaryF14SetupDialog(parent)
        self.stationaryF14SetupDialog = result
        return result


    def build(self, params):
        reportData4100 = [0] * len(Rows4100)
        reportData4100[6] = ''
        clientIdSet = set()
        begDateTime = getBegDateTime(params)
        retireAgeM, retireAgeF = getRetirementAge(begDateTime)
        orgStructureIdList = self.getOrgStructureIdList(params)
        query = selectDataOperation(params, orgStructureIdList)
        while query.next():
            record = query.record()
            actionEndDate = forceDate(record.value('actionEndDate'))
            clientId = forceRef(record.value('clientId'))
            clientAge = forceInt(record.value('clientAge'))
            clientSex = forceInt(record.value('clientSex'))
            operationDevGroup = forceString(record.value('operationDevGroup')).lower()
            if clientId not in clientIdSet:
                clientIdSet.add(clientId)
                reportData4100[0] += 1  # 1. Оперировано пациентов - всего, чел.
                if clientAge < 18:
                    reportData4100[1] += 1  # 2. из них: дети до 17 лет включительно
                if (clientSex == 1 and clientAge >= retireAgeM) or (clientSex == 2 and clientAge >= retireAgeF):
                    reportData4100[2] += 1  # 3. лица старше трудоспособного возраста
            if u'лазерная' in operationDevGroup:
                reportData4100[3] += 1  # 4. проведено операций с использованием, ед.: лазерной аппаратуры
            if u'криогенная' in operationDevGroup:
                reportData4100[4] += 1  # 5. криогенной аппаратуры
            if u'эндоскопическая' in operationDevGroup:
                reportData4100[5] += 1  # 6. эндоскопической аппаратуры
            if u'рентгеновская' in operationDevGroup:
                reportData4100[7] += 1  # 8. рентгеновской аппаратуры
        doc = QtGui.QTextDocument()
        cursor = QtGui.QTextCursor(doc)
        cursor.setCharFormat(CReportBase.ReportTitle)
        cursor.insertText(u'(4100)')
        cursor.insertBlock()
        self.dumpParams(cursor, params)
        cursor.setCharFormat(CReportBase.ReportBody)
        cursor.insertBlock()
        cols = [('50%',[u'Наименование показателей', u'1'], CReportBase.AlignLeft),
                ('10%', [u'№ строки', u'2'], CReportBase.AlignCenter),
                ('10%', [u'Число', u'3'], CReportBase.AlignRight)
                ]
        table = createTable(cursor, cols)
        for row, rowDescr in enumerate(Rows4100):
            i = table.addRow()
            table.setText(i, 0, rowDescr[0])
            table.setText(i, 1, rowDescr[1])
            table.setText(i, 2, reportData4100[row])
        cursor.movePosition(QtGui.QTextCursor.End)
        return doc
